volumeResults/iothreads_1_pipeline_10_connections_512_payload_3_threads_12.txt
====== SET ======
  1000300 requests completed in 1.36 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 0.5 milliseconds
0.01% <= 0.6 milliseconds
0.01% <= 1.8 milliseconds
0.01% <= 1.9 milliseconds
0.03% <= 2 milliseconds
0.17% <= 5 milliseconds
4.58% <= 6 milliseconds
69.32% <= 7 milliseconds
91.14% <= 8 milliseconds
99.02% <= 9 milliseconds
99.13% <= 10 milliseconds
99.15% <= 11 milliseconds
99.16% <= 12 milliseconds
99.36% <= 13 milliseconds
99.75% <= 14 milliseconds
99.92% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
737684.38 requests per second

====== GET ======
  1000110 requests completed in 1.20 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.16% <= 1 milliseconds
0.36% <= 2 milliseconds
0.51% <= 4 milliseconds
0.59% <= 5 milliseconds
68.39% <= 6 milliseconds
93.47% <= 7 milliseconds
97.18% <= 8 milliseconds
97.49% <= 9 milliseconds
97.78% <= 10 milliseconds
97.95% <= 11 milliseconds
98.66% <= 12 milliseconds
98.96% <= 13 milliseconds
99.15% <= 14 milliseconds
99.31% <= 15 milliseconds
99.48% <= 17 milliseconds
99.49% <= 18 milliseconds
99.74% <= 19 milliseconds
99.75% <= 20 milliseconds
99.81% <= 21 milliseconds
99.87% <= 22 milliseconds
99.94% <= 23 milliseconds
99.94% <= 27 milliseconds
99.96% <= 28 milliseconds
100.00% <= 31 milliseconds
100.00% <= 31 milliseconds
834120.12 requests per second

====== HSET ======
  1000140 requests completed in 1.41 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.02% <= 3 milliseconds
0.05% <= 6 milliseconds
73.14% <= 7 milliseconds
91.81% <= 8 milliseconds
97.84% <= 9 milliseconds
98.34% <= 10 milliseconds
98.34% <= 11 milliseconds
98.35% <= 12 milliseconds
98.35% <= 13 milliseconds
98.91% <= 14 milliseconds
99.15% <= 15 milliseconds
99.35% <= 16 milliseconds
99.48% <= 17 milliseconds
99.49% <= 21 milliseconds
99.50% <= 22 milliseconds
99.52% <= 23 milliseconds
99.56% <= 24 milliseconds
99.60% <= 25 milliseconds
99.65% <= 26 milliseconds
99.70% <= 27 milliseconds
99.75% <= 28 milliseconds
99.79% <= 29 milliseconds
99.88% <= 30 milliseconds
99.93% <= 31 milliseconds
99.98% <= 32 milliseconds
99.99% <= 42 milliseconds
100.00% <= 42 milliseconds
709319.19 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  1000130 requests completed in 1.42 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.03% <= 3 milliseconds
0.04% <= 5 milliseconds
0.05% <= 6 milliseconds
67.68% <= 7 milliseconds
89.17% <= 8 milliseconds
97.80% <= 9 milliseconds
98.14% <= 10 milliseconds
98.31% <= 12 milliseconds
98.35% <= 13 milliseconds
98.79% <= 14 milliseconds
99.00% <= 15 milliseconds
99.20% <= 16 milliseconds
99.27% <= 17 milliseconds
99.36% <= 18 milliseconds
99.48% <= 19 milliseconds
99.49% <= 21 milliseconds
99.51% <= 22 milliseconds
99.55% <= 23 milliseconds
99.60% <= 24 milliseconds
99.65% <= 25 milliseconds
99.69% <= 26 milliseconds
99.72% <= 27 milliseconds
99.76% <= 28 milliseconds
99.79% <= 29 milliseconds
99.83% <= 30 milliseconds
99.91% <= 31 milliseconds
99.96% <= 32 milliseconds
99.99% <= 33 milliseconds
100.00% <= 43 milliseconds
100.00% <= 43 milliseconds
703326.25 requests per second

====== LRANGE_100 (first 100 elements) ======
  1001450 requests completed in 10.73 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 25 milliseconds
0.01% <= 26 milliseconds
0.02% <= 27 milliseconds
0.02% <= 28 milliseconds
0.02% <= 29 milliseconds
0.02% <= 30 milliseconds
0.03% <= 31 milliseconds
0.03% <= 32 milliseconds
0.03% <= 33 milliseconds
0.03% <= 34 milliseconds
0.04% <= 35 milliseconds
0.04% <= 42 milliseconds
0.08% <= 43 milliseconds
0.41% <= 44 milliseconds
1.40% <= 45 milliseconds
3.55% <= 46 milliseconds
7.30% <= 47 milliseconds
13.21% <= 48 milliseconds
21.34% <= 49 milliseconds
31.53% <= 50 milliseconds
43.52% <= 51 milliseconds
56.78% <= 52 milliseconds
69.65% <= 53 milliseconds
81.57% <= 54 milliseconds
90.23% <= 55 milliseconds
95.38% <= 56 milliseconds
98.02% <= 57 milliseconds
99.02% <= 58 milliseconds
99.31% <= 59 milliseconds
99.43% <= 60 milliseconds
99.50% <= 61 milliseconds
99.55% <= 62 milliseconds
99.59% <= 63 milliseconds
99.62% <= 64 milliseconds
99.65% <= 65 milliseconds
99.69% <= 66 milliseconds
99.71% <= 67 milliseconds
99.74% <= 68 milliseconds
99.77% <= 69 milliseconds
99.78% <= 85 milliseconds
99.79% <= 86 milliseconds
99.82% <= 87 milliseconds
99.85% <= 88 milliseconds
99.88% <= 89 milliseconds
99.91% <= 90 milliseconds
99.94% <= 91 milliseconds
99.96% <= 92 milliseconds
99.98% <= 93 milliseconds
99.99% <= 94 milliseconds
100.00% <= 94 milliseconds
93297.00 requests per second

====== MSET (10 keys) ======
  1000540 requests completed in 3.71 seconds
  512 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 
  host configuration "appendonly": no
  multi-thread: yes
  threads: 12

0.00% <= 1 milliseconds
0.00% <= 16 milliseconds
0.06% <= 17 milliseconds
17.81% <= 18 milliseconds
77.87% <= 19 milliseconds
90.08% <= 20 milliseconds
98.61% <= 21 milliseconds
99.00% <= 22 milliseconds
99.03% <= 31 milliseconds
99.07% <= 32 milliseconds
99.11% <= 33 milliseconds
99.11% <= 35 milliseconds
99.14% <= 36 milliseconds
99.35% <= 37 milliseconds
99.40% <= 38 milliseconds
99.49% <= 39 milliseconds
99.57% <= 40 milliseconds
99.60% <= 51 milliseconds
99.62% <= 52 milliseconds
99.67% <= 53 milliseconds
99.76% <= 54 milliseconds
99.85% <= 55 milliseconds
99.94% <= 56 milliseconds
99.98% <= 57 milliseconds
100.00% <= 57 milliseconds
269832.81 requests per second